cfe llm/InformationRegisters/AI_ОчередьВекторизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>AI_ОчередьВекторизации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗаголовокЧанка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подзаголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодзаголовокВторогоУровня</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсегоЧанков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЧанка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЧанка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтекстТекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображаемыйТекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_ИсточникТипДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникВнутреннийТип</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НавигационнаяСсылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСущности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Секция</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияИГуид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тенант</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разрешения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Коллекция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AI_RAGКоллекции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УникальныйИдентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfe llm/InformationRegisters/AI_ОчередьВекторизации/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция ПолучитьПараметрыЭлемента() Экспорт
	
	СтруктураЭлемента = Новый Структура;

	// Обязательные параметры
	СтруктураЭлемента.Вставить("Коллекция", Неопределено);
	СтруктураЭлемента.Вставить("Ссылка", Неопределено);
	СтруктураЭлемента.Вставить("ЗаголовокЧанка", "");
	СтруктураЭлемента.Вставить("Данные", "");
	
	// Назначение для маршрутизации, например:
	//	documentation
	//	counterparty
	//	nomenclature
	//	contract
	//	document
	//	metadata
	//	code
	//	faq
	//	ticket
	//	comment
	СтруктураЭлемента.Вставить("ИсточникТипДанных", Неопределено); 
	
	// Необязательные параметры
	СтруктураЭлемента.Вставить("КонтекстТекст", "");
	СтруктураЭлемента.Вставить("ОтображаемыйТекст", "");
	СтруктураЭлемента.Вставить("Источник", СтрокаСоединенияИнформационнойБазы());
	СтруктураЭлемента.Вставить("ОрганизацияИГУИД", "default");
	СтруктураЭлемента.Вставить("Тенант", "main");
	СтруктураЭлемента.Вставить("Язык", "ru");
	СтруктураЭлемента.Вставить("Разрешения", "all");
	
	// Использовать если больше одного чанка
	СтруктураЭлемента.Вставить("Подзаголовок", "");
	СтруктураЭлемента.Вставить("ПодзаголовокВторогоУровня", "");
	СтруктураЭлемента.Вставить("ВсегоЧанков", 1);
	СтруктураЭлемента.Вставить("НомерЧанка", 1);
	
	// Раздел внутри объекта - внутри нескольких чанков например:
	// 	Для номенклатуры - Характеристики, для договора - Условия оплаты, для документации - порядок заполнения, 
	// 	для кода - ОбщийМодуль.РаботаСЦенами.ПолучитьЦену
	СтруктураЭлемента.Вставить("Секция", ""); 
	
	Возврат СтруктураЭлемента;
	
КонецФункции

Функция ЗаписатьЭлементВекторизации(СтруктураЭлемента) Экспорт
	
	НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(СтруктураЭлемента.Ссылка);
	
	ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.SHA256);
	ХешированиеДанных.Добавить(СтруктураЭлемента.Данные);
	ХешДанных = ХешированиеДанных.ХешСумма;
	
	ТипСущности = XMLТипЗнч(СтруктураЭлемента.Ссылка).ИмяТипа;
	
	Если НЕ ТипЗнч(СтруктураЭлемента.Коллекция) = Тип("Массив") Тогда
		ИтоговыйСписокКоллекций = Новый Массив;
		ИтоговыйСписокКоллекций.Добавить(СтруктураЭлемента.Коллекция);
	Иначе
		ИтоговыйСписокКоллекций = СтруктураЭлемента.Коллекция;
	КонецЕсли;
	
	Для Каждого Коллекция Из ИтоговыйСписокКоллекций Цикл
		
		МенеджерЗаписи = РегистрыСведений.AI_ОчередьВекторизации.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Коллекция = Коллекция;
		МенеджерЗаписи.УникальныйИдентификатор = Новый УникальныйИдентификатор; 
		// Детерминированный UUID — одинаков при повторных записях одного чанка,
		// что позволяет корректно пропускать чанки без изменений (проверка ХешДанных)
		МенеджерЗаписи.ИдентификаторЧанка = ДетерминированныйUUIDЧанка(НавигационнаяСсылка, СтруктураЭлемента.НомерЧанка);
		
		МенеджерЗаписи.ЗаголовокЧанка = СтруктураЭлемента.ЗаголовокЧанка; // То что должно записываться в каждое сообщение чанка
		МенеджерЗаписи.Подзаголовок = СтруктураЭлемента.Подзаголовок; // То что позволяет детализировать информацию о чанке
		МенеджерЗаписи.ПодзаголовокВторогоУровня = СтруктураЭлемента.ПодзаголовокВторогоУровня; // То что позволяет детилизировать информацию о чанке
		МенеджерЗаписи.ВсегоЧанков = СтруктураЭлемента.ВсегоЧанков; // Общее количество чанков
		МенеджерЗаписи.НомерЧанка = СтруктураЭлемента.НомерЧанка; // Номер текущего чанка
		
		МенеджерЗаписи.Данные = СтруктураЭлемента.Данные; // Для векторизации
		
		// Необязательные 
		МенеджерЗаписи.КонтекстТекст = ?(ЗначениеЗаполнено(СтруктураЭлемента.КонтекстТекст), СтруктураЭлемента.КонтекстТекст, СтруктураЭлемента.Данные); // Для LLM
		МенеджерЗаписи.ОтображаемыйТекст = ?(ЗначениеЗаполнено(СтруктураЭлемента.ОтображаемыйТекст), СтруктураЭлемента.ОтображаемыйТекст, СтруктураЭлемента.Данные); // Для UI
		МенеджерЗаписи.Источник = СтруктураЭлемента.Источник; // Какой то идентификатор базы
		МенеджерЗаписи.Секция = СтруктураЭлемента.Секция; 
		МенеджерЗаписи.ОрганизацияИГуид = СтруктураЭлемента.ОрганизацияИГуид; // Для поиска в рамках разрешенных организаций
		МенеджерЗаписи.Тенант = СтруктураЭлемента.Тенант; // Разрез в рамках организации
		МенеджерЗаписи.Язык = СтруктураЭлемента.Язык;
		МенеджерЗаписи.Разрешения = СтруктураЭлемента.Разрешения; // У агента должно быть задано с какими правами алгоритм будет искать в векторной БД
		
		//МенеджерЗаписи._ИсточникТипДанных = СтруктураЭлемента.ИсточникТипДанных; // Договор, справочная информация, метаданные // Пока не заполняем
		// Заполним из самой коллекции при отправке
		
		МенеджерЗаписи.ИсточникВнутреннийТип = ТипСущности; // Детализация имени типа объекта метаданных
		МенеджерЗаписи.ХешДанных = ХешированиеДанных.ХешСумма; // Хеш данных для идентификации изменения данных при обновлении объекта
		МенеджерЗаписи.НавигационнаяСсылка = НавигационнаяСсылка; // Строковая ссылка для возможности ссылаться на конкретный элемент базы
		МенеджерЗаписи.ИдентификаторСущности = СтруктураЭлемента.Ссылка.УникальныйИдентификатор();
		
		МенеджерЗаписи.Записать(Истина);
		
	КонецЦикла
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедуры

// Генерирует детерминированный UUID для чанка на основе НавигационнаяСсылка + НомерЧанка.
// Один и тот же чанк всегда получает один и тот же UUID, что позволяет:
//   1. Корректно проверять хеш данных и пропускать неизменённые чанки
//   2. Делать upsert в Qdrant по стабильному ID (не создавать дубли точек)
Функция ДетерминированныйUUIDЧанка(НавигационнаяСсылка, НомерЧанка)

	Хеш = Новый ХешированиеДанных(ХешФункция.MD5);
	Хеш.Добавить(НавигационнаяСсылка + "|" + Строка(НомерЧанка));
	Буфер = ПолучитьБуферДвоичныхДанныхИзДвоичныхДанных(Хеш.ХешСумма);

	ШС = "0123456789abcdef";
	С = "";
	Для Индекс = 0 По 15 Цикл
		Б = Буфер[Индекс];
		С = С + Сред(ШС, Цел(Б / 16) + 1, 1) + Сред(ШС, Б % 16 + 1, 1);
	КонецЦикла;

	// Форматируем как UUID: xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx
	Возврат Новый УникальныйИдентификатор();

КонецФункции

#КонецОбласти
